---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LockedStartOffset
source: html/5a363d30-712c-8706-bf44-9967cf764265.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LockedStartOffset Property

"Negative Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId LockedStartOffset { get; }
```